{
    "navbar": [
        { "id": "home", "text": "Home" },
        { "id": "education", "text": "Education" },
        { "id": "research", "text": "Research" },
        { "id": "projects", "text": "Projects" },
        { "id": "experience", "text": "Experience" },
        { "id": "skills", "text": "Skills & Honors" },
        { "id": "news", "text": "Latest News" }
    ],
    "profile": {
        "name": "Xiangling Wu",
        "title": "Environmental Science & Engineering | Ph.D. Candidate",
        "tags": [
            "CPC Member",
            "Tsinghua University",
            "National University of Singapore"
        ],
        "contact": {
            "email": "xxzwuxl@163.com",
            "phone": "13551354185"
        },
        "avatar": "assets/media/image1.jpeg"
    },
    "news": [
        {
            "date": "Jan 2026",
            "title": "Started Joint PhD Program at National University of Singapore",
            "content": "Officially commenced research at NUS; exploring cross-disciplinary paths in environment & AI."
        },
        {
            "date": "Dec 2025",
            "title": "Participated in AUA Graduate Forum & GBA Nanshan Academic Forum",
            "content": "Presented the topic “Use of Polyurethane Sponge for rapid start-up of anammox: microbial enrichment and spatial distribution of functional genes”, and was invited to deliver a speech as student representative at the closing ceremony."
        },
        {
            "date": "Jul 2025",
            "title": "Participated in International Anammox Symposium & First National Anammox Technology Exchange Conference",
            "content": "Delivered an oral presentation on “Accelerating start-up of anammox in MBBR using polyurethane sponge carriers” and won the Best Presentation Award."
        }
    ],
    "education": [
        {
            "time": "Jan 2026 - Present",
            "school": "National University of Singapore (NUS)",
            "major": "Environmental Science & Engineering (Joint Ph.D.) | QS Rank 8",
            "desc": ""
        },
        {
            "time": "Sep 2023 - Present",
            "school": "Tsinghua University",
            "major": "Environmental Science & Engineering | Ph.D.",
            "desc": "GPA: 3.97/4.00 (Top 1%)"
        },
        {
            "time": "Sep 2019 - Jun 2022",
            "school": "Sichuan Agricultural University",
            "major": "Civil & Hydraulic Engineering | Master",
            "desc": "Provincial Outstanding Graduate | National Scholarship"
        },
        {
            "time": "Sep 2015 - Jun 2019",
            "school": "Sichuan Agricultural University",
            "major": "Water Supply & Drainage Science and Engineering | Bachelor (Recommended for Admission)\nFinance | Bachelor (Double Degree)",
            "desc": ""
        }
    ],
    "research": {
        "intro": [
            "Development of low-carbon processes for urban sewage treatment towards dual-carbon goals, regulation of microbial metabolic mechanisms, and system engineering applications.",
            "Dedicated to the synergistic resource utilization path of kitchen waste and sewage treatment, converting biochemical reaction mechanisms into industrial Standard Operating Procedures (SOP) to achieve long-term stable operation and low-carbon delivery of engineering projects."
        ],
        "stats": [
            {
                "icon": "fas fa-file-alt",
                "number": "8",
                "label": "Published Papers"
            },
            {
                "icon": "fas fa-certificate",
                "number": "12",
                "label": "Applications & Authorized Patents"
            },
            {
                "icon": "fas fa-star",
                "number": "55+",
                "label": "Cumulative IF"
            },
            {
                "icon": "fas fa-microphone",
                "number": "4",
                "label": "Oral Presentations"
            }
        ],
        "papers": [
            "[1] Ke Zhang*,1, Xiangling Wu1, Wei Wang, et al., 2022. Anaerobic oxidation of methane (AOM) driven by multiple electron acceptors in constructed wetland and the related mechanisms of carbon, nitrogen, sulfur cycles. Chemical Engineering Journal (IF 13.3, 36 Cites), 133663, 2021.11.18",
            "[2] Ke Zhang*,1, Xiangling Wu1, Jia Chen, et al., 2021. The role and related microbial processes of Mn-dependent anaerobic methane oxidation in reducing methane emissions from constructed wetland-microbial fuel. Journal of Environmental Management (IF 8, 70 Cites), 294, 112935, 2021.6.10",
            "[3] Ke Zhang*, Xiangling Wu, Hongbing Luo, et al., 2020. CH4 control and associated microbial process from constructed wetland (CW) by microbial fuel cells (MFC). Journal of Environmental Management (IF 8, 28 Cites), 260, 110071, 2020.01.25",
            "[4] Ke Zhang*,1, Xiangling Wu1, Wei Wang, et al., 2021. Roles of external circuit and rhizosphere location in CH4 emission control in sequencing batch flow constructed wetland-microbial fuel cell. Journal of Environmental Chemical Engineering (IF 7.4, 14 Cites), 9, 106583, 2021.10.16",
            "[5] Ke Zhang*,1, Xiangling Wu1, Wei Wang, et al., 2021. Effects of plant location on methane emission, bioelectricity generation, pollutant removal and related biological processes in microbial fuel cell constructed wetland. Journal of Water Process Engineering (IF 6.3, 20 Cites), 43, 102283, 2021.9.1",
            "[6] Ke Zhang*, Xiangling Wu, Wei Wang, et al., 2021. Effects of bioelectrochemical technique on methane emission and energy recovery in constructed wetlands (CWs) and related biological mechanisms, Environmental Technology (IF 2.2), 9, 106583, 2021.9.20",
            "[7] Ke Zhang*,1, Xiangling Wu1, Hongbing Luo, et al., 2020. Biochemical pathways and enhanced degradation of dioctyl phthalate (DEHP) by sodium alginate immobilization in MBR system. Water Science & Technology (IF 2.5), 83(2)",
            "[8] Ke Zhang*,1, Xiangling Wu1, Wei Wang, et al., 2019. Biodegradation of diethyl phthalate by Pseudomonas sp. BZD-33 isolated from active sludge. Earth and Environmental Science (EI Regular Issue), 295, 012070"
        ],
        "patents": [
            "Invention Patents:",
            "[1] Zhang Ke, Wu Xiangling, Wang Wei, Luo Hongbing, Chen Jia, Yang Siqiao, Zhou Zhao, Wang Tingting, Cao Huiling, Guo Jingyue. A CW-MFC device and method for reducing methane and ammonia nitrogen pollution. ZL 2020 1 1011944.0, 2021.8.24",
            "[2] Zhang Ke, Wu Xiangling, Chen Jia, Chen Wei, Chen Jian, Yang Siqiao. A U-shaped device and operation method for microbial fuel cell coupled constructed wetland. ZL 2019 1 1263024.5, 2021.10.19",
            "[3] Lin Lin, Wu Xiangling, Li Xiaoyan, Sun Deshou, Li Yingyu, Zhu Chengzhi. Wastewater denitrification treatment system and its treatment method. ZL 2023 1 1635783.6, 2025.11.11",
            "[4] Lin Lin, Wu Xiangling, Sun Deshou, Li Xiaoyan, Li Bing. Sewage treatment device, 202410646050.0, 2024.5.23",
            "[5] Lin Lin, Wu Xiangling, Li Xiaoyan, Sun Deshou, Li Yingyu, Zhu Chengzhi. Wastewater denitrification treatment system and its treatment method. 202311635783.6, 2023.11.30",
            "International Patents:",
            "[6] Ke Zhang, Xiangling Wu, Jia Chen, Hongbing Luo, Wei Wang, Siqiao Yang, Zhou Zhao, Tingting Wang, Huiling Cao, Jingyue Guo, Preparation method of sodium alginate composite immobilized microbial inoculum capable of remarkably improving degradation efficiency of quinclorac, 2020103347, 2021.1.6",
            "[7] Ke Zhang, Xiangling Wu, Wei Wang, Hongbing Luo, Jia Chen, Siqiao Yang, Zhou Zhao, Tingting Wang, Huiling Cao, Jingyue Guo, A device for enhancing denitrification by combining a horizontal subsurface flow with a vertical flow CW-MFC system in series and an operation method thereof, 2020103245, 2020.12.23",
            "Utility Model Patents:",
            "[8] Zhang Ke, Wu Xiangling, Chen Jian, Chen Wei. Highway runoff treatment system based on constructed wetland coupled with microbial fuel cell. ZL 2019 2 0036586.5, 2019.11.5",
            "[9] Zhang Ke, Wu Xiangling, Chen Jian, Chen Jia, Yang Siqiao. A peristaltic pump with anti-air suction. ZL 2019 2 0489398.8, 2019.11.22",
            "[10] Zhang Ke, Wu Xiangling, Chen Jian, Chen Wei, Chen Jia. Highway sewage treatment system by constructed wetland coupled with microbial fuel cell. ZL 2019 2 0035992.X, 2019.12.3",
            "Software Copyright:",
            "[11] Zhang Ke, Wu Xiangling, Chen Jian, Chen Jia, Wang Tingting, Xia Junwen, Huang Wenya, Yang Qingchi. Automatic control system for constructed wetland coupled microbial fuel cell experiments V1.0. 2019SR0516626, 2019.5.24",
            "[12] Zhang Ke, Wu Xiangling, Chen Jian, Yang Siqiao, Chen Jia, Zhou Zixuan, Zhou Wenni, Zhou Zhao. Microbial fuel cell coupled constructed wetland biosensor water quality monitoring system V1.0. 2020SR0086259, 2020.1.16"
        ]
    },
    "projects": [
        {
            "name": "Innovation & Entrepreneurship Competition | Carbon Chain Synergy & Value Transformation Platform",
            "role": "Project Leader & Captain",
            "date": "Mar 2025 - Dec 2025",
            "details": [
                "<strong>Problem Definition:</strong> Targeting the fragmentation of accounting standards and mismatch of benefits, proposing a digital collaborative solution.",
                "<strong>Cross-boundary Coordination:</strong> Led a cross-disciplinary team from Tsinghua and Peking University to develop an AI carbon platform (98% accuracy), solving the pain point of manual accounting efficiency.",
                "<strong>Achievements:</strong> Won National Third Prize in Graduate \"Dual Carbon\" Competition, First Prize at Tsinghua, and Winner of Kunshan Cup."
            ]
        },
        {
            "name": "Shenzhen Science and Technology Innovation Commission Sustainable Development Special Project | R&D and Application of Kitchen Waste Hydrolysate PD/A Denitrification Process",
            "role": "Student Leader",
            "date": "Sep 2022 - Present",
            "details": [
                "<strong>Technical R&D:</strong> Led the R&D of a PD/A coupling system based on kitchen waste, overcoming the industry-level bottleneck of microbial community instability.",
                "<strong>Commercialization:</strong> In-situ conversion completely replaced external carbon sources, reducing costs by 30%~50%, and implementing a 50 m³/d demonstration project."
            ]
        },
        {
            "name": "National Key R&D Program Youth Project | Low-carbon Preparation of Bio-based Plastics from Brewing Waste",
            "role": "Main Researcher",
            "date": "Oct 2024 - Present",
            "details": [
                "<strong>Product R&D:</strong> Developed new bio-based materials, extending the shelf life of fruits and vegetables by more than 1 time and reducing raw material costs by 40%."
            ]
        }
    ],
    "internships": [
        {
            "company": "New Hope Wuxin Industry Group Co., Ltd.",
            "position": "Business Management Center | Planning Dept Intern | Jul 2020 - Sep 2020",
            "desc": "Produced a 10,000-word research report, with 5 suggestions fully adopted."
        },
        {
            "company": "Country Garden Holdings Co., Ltd.",
            "position": "Project Marketing Dept | Marketing Management Intern | May 2020 - Jul 2020",
            "desc": "Became the top salesperson in the first month of employment; conversion rate significantly better than average."
        },
        {
            "company": "Vanke Co., Ltd.",
            "position": "Digital Technology Center | Digital Operations Intern | Feb 2021 - Apr 2021",
            "desc": "Unified 200+ key field calibers across the entire chain and established a structured maintenance mechanism."
        }
    ],
    "campus": [
        {
            "org": "Tsinghua SIGS Counseling Center",
            "role": "Counselor & Psychology Club President | Mar 2023 - Sep 2025",
            "desc": "Built a Chinese-English bilingual psychological support system, improving organizational efficiency by 60%."
        },
        {
            "org": "University Art Troupe",
            "role": "Dance Troupe Leader | Sep 2016 - Sep 2018",
            "desc": "Pioneered a closed-loop management system, coordinated 40+ performances, and achieved the first campus championship."
        },
        {
            "org": "Tsinghua Environmental Class 23",
            "role": "Class Monitor | Sep 2023 - Sep 2024",
            "desc": "Awarded Tsinghua \"Outstanding Class\" (Top 5%), with 100% peer review excellence rate for three consecutive years."
        }
    ],
    "skills": {
        "languages": [
            "English (CET-6, NUS Joint Program)",
            "German (B1 Level)",
            "Mandarin (Level 2-A)"
        ],
        "data_research": [
            "R, SPSS, Linux (Modeling & Statistics)",
            "Origin (Scientific Plotting)",
            "MS Office"
        ],
        "design_ops": [
            "Ps, Ai, Canva",
            "Xiumi, Digital Operation Tools"
        ]
    },
    "honors": "National Scholarship, Provincial Outstanding Graduate, Outstanding Student Cadre, Tsinghua Comprehensive Scholarship, Outstanding Social Work Scholarship, Sichuan Agricultural University Annual Outstanding Graduate Student Model, Master's Academic Scholarship, Outstanding Academic Achievement, Best Presentation Award, Outstanding Literary and Artistic Backbone, etc.",
    "interests": "Badminton, Classical Dance, Swimming, Football, Music, Hiking",
    "section_titles": {
        "news": "Latest News",
        "education": "Education",
        "research": "Research & Achievements",
        "research_direction": "Research Direction",
        "papers": "Published Papers",
        "patents": "Applications & Authorized Patents",
        "projects": "Key Projects",
        "internships": "Internships",
        "campus": "Campus Experience",
        "skills": "Skills & Honors",
        "skills_lang": "Languages",
        "skills_data": "Data & Research",
        "skills_design": "Design & Ops",
        "honors": "Honors & Awards",
        "interests": "Interests"
    }
}
